m = ['可口可樂', '月亮蝦餅', '黃咖哩炒蝦']
yee = []
while True:
    print(yee)
    print('1. 新增餐點')
    print('2. 移除餐點')
    print('3. 提交菜單')
    applebananaorange = input('請輸入功能')
    if applebananaorange == "1":
        for orange in range(len(m)):
            print(f'{orange+1}. {m[orange]}')

        apple = int(input('請輸入餐點:'))
        if apple > len(m):
            print('滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾')
        else:
            yee.append(m[apple-1])

    elif applebananaorange == "2":
        apple = input('請輸入移除餐點:')
        while apple in yee:
            yee.remove(apple)

        print('已經取消了')

    elif applebananaorange == "3":
        # if yee.count('可口可樂') != 0:
        #     print(f"可口可樂x{yee.count('可口可樂')}")
        # if yee.count('月亮蝦餅') != 0:
        #     print(f"月亮蝦餅x{yee.count('月亮蝦餅')}")
        # if yee.count('黃咖哩炒蝦') != 0:
        #     print(f"黃咖哩炒蝦x{yee.count('黃咖哩炒蝦')}")
        for i in m:
            if i in yee:
                print(f"{i}x{yee.count(i)}")
        break
    else:
        print('滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾滾')
